PhanLeSon03/Mic_Array/Projects/STM32746G/Applications/Audio/Mic_Array/Src/waverecorder.c

/* Includes ------------------------------------------------------------------*/
#include "waverecorder.h" 
#include "string.h"
//#include "stm32f7xx_hal_spi.h"
#include "stm32f7xx_hal.h"
#include "pdm_filter.h"


/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define TOUCH_RECORD_XMIN       300
#define TOUCH_RECORD_XMAX       340
#define TOUCH_RECORD_YMIN       212
#define TOUCH_RECORD_YMAX       252

#define TOUCH_STOP_XMIN         205
#define TOUCH_STOP_XMAX         245
#define TOUCH_STOP_YMIN         212
#define TOUCH_STOP_YMAX         252

#define TOUCH_PAUSE_XMIN        125
#define TOUCH_PAUSE_XMAX        149
#define TOUCH_PAUSE_YMIN        212
#define TOUCH_PAUSE_YMAX        252

#define TOUCH_VOL_MINUS_XMIN    20
#define TOUCH_VOL_MINUS_XMAX    70
#define TOUCH_VOL_MINUS_YMIN    212
#define TOUCH_VOL_MINUS_YMAX    252

#define TOUCH_VOL_PLUS_XMIN     402
#define TOUCH_VOL_PLUS_XMAX     452
#define TOUCH_VOL_PLUS_YMIN     212
#define TOUCH_VOL_PLUS_YMAX     252



/* SPI Configuration defines */
#define SPI_SCK_PIN                       GPIO_PIN_10
#define SPI_SCK_GPIO_PORT                 GPIOB
#define SPI_SCK_GPIO_CLK                  1
#define SPI_SCK_SOURCE                    1
#define SPI_SCK_AF                        GPIO_AF5_SPI2

#define SPI_MOSI_PIN                      GPIO_PIN_3
#define SPI_MOSI_GPIO_PORT                GPIOC
#define SPI_MOSI_GPIO_CLK                 1
#define SPI_MOSI_SOURCE                   1
#define SPI_MOSI_AF                       GPIO_AF5_SPI2


/* sop1hc */
#define SPI1_SCK_PIN                       GPIO_PIN_5
#define SPI1_SCK_GPIO_PORT                 GPIOA
#define SPI1_SCK_GPIO_CLK                  1
#define SPI1_SCK_SOURCE                    1
#define SPI1_SCK_AF                        GPIO_AF5_SPI1

#define SPI1_MOSI_PIN                      GPIO_PIN_7
#define SPI1_MOSI_GPIO_PORT                GPIOA
#define SPI1_MOSI_GPIO_CLK                 1
#define SPI1_MOSI_SOURCE                   1
#define SPI1_MOSI_AF                       GPIO_AF5_SPI1

#define SPI1_MISO_PIN                      GPIO_PIN_6
#define SPI1_MISO_GPIO_PORT                GPIOA
#define SPI1_MISO_GPIO_CLK                 1
#define SPI1_MISO_SOURCE                   1
#define SPI1_MISO_AF                       GPIO_AF5_SPI1




uint16_t idxMic8=0;
uint16_t idxMic7=0;
uint8_t pHeaderBuff[44];
//uint16_t Buffer1[AUDIO_IN_PCM_BUFFER_SIZE];
uint16_t volatile cntTransFinish;

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
extern  AUDIO_IN_BufferTypeDef  stkBufferCtlRecIn,stkBuffer1, stkBuffer2;
extern AUDIO_OUT_BufferTypeDef  BufferCtlPlayOut;
extern uint16_t __IO idxSPI5DataBuf1, idxSPI5DataBuf2;
extern WAVE_FormatTypeDef WaveFormat;
extern FIL WavFile;
extern AUDIO_DEMO_StateMachine AudioDemo;
extern AUDIO_PLAYBACK_StateTypeDef AudioState;
extern __IO uint8_t buffer_switch;
extern __IO uint8_t volume;
extern SPI_HandleTypeDef hspi4,hspi1;
extern __IO uint16_t  WaveRec_idxSens1,WaveRec_idxSens2;
extern __IO uint16_t  WaveRec_idxSens3,WaveRec_idxSens4;
extern __IO uint16_t  WaveRec_idxSens5,WaveRec_idxSens6;
extern __IO uint16_t  I2S2_idxTmp;
extern SPI_HandleTypeDef     hspi4;
extern DMA_HandleTypeDef     DmaHandle;

#ifndef CS43L22_PLAY
extern __IO uint8_t flgDlyUpd; 
extern __IO uint32_t XferCplt;
extern __IO uint16_t  idxSPI5DataBuf3;
#endif

__IO int16_t TestSDO12[4*AUDIO_OUT_BUFFER_SIZE];
__IO int16_t TestSDO34[4*AUDIO_OUT_BUFFER_SIZE];
__IO int16_t TestSDO56[4*AUDIO_OUT_BUFFER_SIZE];
__IO uint16_t TestSDO7[4*AUDIO_OUT_BUFFER_SIZE];
__IO uint16_t TestSDO8[4*AUDIO_OUT_BUFFER_SIZE];
__IO uint16_t TestSDO7_1[4*AUDIO_OUT_BUFFER_SIZE];
__IO uint16_t TestSDO8_1[4*AUDIO_OUT_BUFFER_SIZE];


SPI_HandleTypeDef hspi1,hspi2;
SPI_HandleTypeDef spi1_ins,spi2_ins;
I2S_HandleTypeDef hi2s1;
I2S_HandleTypeDef hi2s2;
SPI_HandleTypeDef hspi5,hspi6;
DMA_HandleTypeDef hdma_spi2_tx;
DMA_HandleTypeDef hdma_spi3_tx;
DMA_HandleTypeDef     hdma_spi5_rx,hdma_spi6_rx;

#if USB_STREAMING
__IO uint16_t idxFrmPDMMic8;
#endif

uint16_t *bufPCMSens7;
uint16_t *bufPCMSens8;
__IO uint16_t cntPos;
__IO uint16_t cntPos7;
__IO static uint16_t iBuff;
__IO static uint32_t uwVolume = 70;
__IO PDMFilter_InitStruct Filter[2];
__IO uint16_t  pDataMic8[64];//INTERNAL_BUFF_SIZE
__IO uint16_t  pDataMic7[64];//INTERNAL_BUFF_SIZE
__IO int16_t   pPDM2PCM[16];
__IO uint16_t cntStrt;
__IO uint8_t WaveRecord_flgInt;
uint8_t WaveRecord_flgIni;

uint16_t vRawSens1,vRawSens2,vRawSens4,vRawSens3,vRawSens5,vRawSens6;  
__IO int16_t SPI1_stNipple,I2S1_stNipple, I2S2_stNipple,SPI4_stNipple;
__IO uint16_t iSDO12,iSDO34,iSDO56;
__IO uint8_t swtSDO7,swtSDO8;
__IO uint8_t WaveRecord_flgSDO7Finish,WaveRecord_flgSDO8Finish;
__IO uint8_t I2S1_stPosShft,I2S2_stPosShft,SPI4_stPosShft;

/* Private function prototypes -----------------------------------------------*/
static void SPI_I2S_SendData(SPI_TypeDef* SPIx, uint16_t Data);
static uint16_t SPI_I2S_ReceiveData(SPI_TypeDef* SPIx);
static void I2S1_Init(void);
static void I2S2_Init(void);

#pragma location=SDRAM_BANK_ADDR
Mic_Array_Data Buffer1;
#pragma location= (SDRAM_BANK_ADDR+ BUFFER_SIZE_BYTE)
Mic_Array_Data Buffer2;
#pragma location= (SDRAM_BANK_ADDR+ BUFFER_SIZE_BYTE + BUFFER_SIZE_BYTE)
Mic_Array_Data Buffer3;

void SPI1_Ini(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;

 
   	 
  /* Enable SCK, MOSI and MISO GPIO clocks */
  __HAL_RCC_SPI1_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();

  
  GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStructure.Pull  = GPIO_PULLDOWN;
  GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;

  /* SPI SCK pin configuration */
  GPIO_InitStructure.Alternate = SPI1_SCK_AF;
  GPIO_InitStructure.Pin = SPI1_SCK_PIN;
  HAL_GPIO_Init(SPI1_SCK_GPIO_PORT,&GPIO_InitStructure);

  /* SPI  MOSI pin configuration */
  GPIO_InitStructure.Alternate = SPI1_MOSI_SOURCE;
  GPIO_InitStructure.Pin =  SPI1_MOSI_PIN;
  HAL_GPIO_Init(SPI1_MOSI_GPIO_PORT, &GPIO_InitStructure);

  /* SPI MISO pin configuration */
  GPIO_InitStructure.Alternate = SPI1_MISO_SOURCE;
  GPIO_InitStructure.Pin = SPI1_MISO_PIN;
  HAL_GPIO_Init(SPI1_MISO_GPIO_PORT, &GPIO_InitStructure);

  /* SPI configuration -------------------------------------------------------*/
  //SPI_I2S_DeInit(SPI1);
  
  spi1_ins.Init.Direction = SPI_DIRECTION_2LINES_RXONLY;
  spi1_ins.Init.DataSize = SPI_DATASIZE_16BIT;
  spi1_ins.Init.CLKPolarity = SPI_POLARITY_LOW;
  spi1_ins.Init.CLKPhase = SPI_PHASE_1EDGE;
  spi1_ins.Init.NSS = SPI_NSS_SOFT;
  spi1_ins.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_64;
  spi1_ins.Init.FirstBit = SPI_FIRSTBIT_MSB;
  spi1_ins.Init.CRCPolynomial = 7;
  spi1_ins.Init.Mode = SPI_MODE_SLAVE;
  if(HAL_SPI_Init(&spi1_ins) != HAL_OK)
  {
    /* Initialization Error */
    //Error_Handler();
  }
  
 
