PhanLeSon03/Mic_Array/Projects/STM32746G/Applications/Audio/Mic_Array/Src/waverecorder.c
  GPIO_InitStructure.Pin = GPIO_PIN_3;
  GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStructure.Speed = GPIO_SPEED_FAST;
  GPIO_InitStructure.Pull = GPIO_PULLUP;
  //GPIO_InitStructure.Alternate 
  HAL_GPIO_Init(GPIOE, &GPIO_InitStructure);

  /* Deselect : Chip Select high */
  HAL_GPIO_WritePin(GPIOE,GPIO_PIN_3,GPIO_PIN_SET);
   /* sop1hc */
  /* Configure the SPI interrupt priority */
  HAL_NVIC_SetPriority(SPI1_IRQn, INTERRUPT_PRI_SDO12, 0);

  HAL_NVIC_EnableIRQ(SPI1_IRQn);
  //SPI_I2S_ITConfig(SPI1, SPI_I2S_IT_RXNE, ENABLE);
  //__HAL_SPI_ENABLE_IT(SPI1,SPI_IT_TXE);

  /* Enable SPI1  */
  //__HAL_SPI_ENABLE(SPI1);

}

void mySPI_SendData(uint8_t adress, uint8_t data)
{
 
while(!__HAL_SPI_GET_FLAG(&spi1_ins, SPI_FLAG_TXE)); 
SPI_I2S_SendData(SPI1, adress);

while(!__HAL_SPI_GET_FLAG(&spi1_ins, SPI_FLAG_RXNE));
SPI_I2S_ReceiveData(SPI1);

while(!!__HAL_SPI_GET_FLAG(&spi1_ins, SPI_FLAG_TXE)); 
SPI_I2S_SendData(SPI1, data);

while(!!__HAL_SPI_GET_FLAG(&spi1_ins, SPI_FLAG_RXNE));
SPI_I2S_ReceiveData(SPI1);
 
}

/**
  * @brief  This function handles AUDIO_REC_SPI global interrupt request.
  * @param  None
  * @retval None
*/

void SPI1_IRQHandler(void)
{  
      uint16_t tmpTest;
	  static uint8_t stLR,stLROld;

	  /* USER CODE BEGIN SPI5_IRQn 0 */
	
	  /* USER CODE END SPI5_IRQn 0 */
	  //HAL_SPI_IRQHandler(&hspi5);
	  /* USER CODE BEGIN SPI5_IRQn 1 */
	
	  /* USER CODE END SPI5_IRQn 1 */
		/* Check if data are available in SPI Data register */
	  /* SPI in mode Receiver ----------------------------------------------------*/
	  if(
//	     (__HAL_SPI_GET_FLAG(&hi2s1, SPI_FLAG_OVR) == RESET)&&
//	     (__HAL_SPI_GET_FLAG(&hi2s1, SPI_FLAG_RXNE) != RESET)&&
		 (__HAL_I2S_GET_IT_SOURCE(&hi2s1, SPI_IT_RXNE) != RESET))
	  {
	

	   tmpTest =  SPI_I2S_ReceiveData(SPI1);
	
	   /* Left-Right Mic data */
	   stLR= HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_4);
	
		if (stLR==GPIO_PIN_SET)
		{
				if (stLROld==GPIO_PIN_RESET)
				{
					SPI1_stNipple = (tmpTest);

				}
				else
				{
					 vRawSens1 =((tmpTest>>I2S1_stPosShft)|(SPI1_stNipple<<(SDOLEN-I2S1_stPosShft)));	
				   
				}
		}
		else
		{
			  if (stLROld==GPIO_PIN_SET)
			  {
				  SPI1_stNipple = (tmpTest);  

			  }
			  else
			  {
				  vRawSens2 =((tmpTest>>I2S1_stPosShft)|(SPI1_stNipple<<(SDOLEN-I2S1_stPosShft)));

			  } 	
		}
	   
	   if (iSDO12<4*AUDIO_OUT_BUFFER_SIZE)
	   {
           TestSDO12[iSDO12++]=tmpTest;
	   }
	   else
	   {
           iSDO12=0;
	   }
#if 1
		if ((WaveRec_idxSens1 < (2*AUDIO_OUT_BUFFER_SIZE+1))&&(WaveRec_idxSens2 < (2*AUDIO_OUT_BUFFER_SIZE+1)))
	//			  &&(stLR!=stLROld))
		{
	/*-------------------------------------------------------------------------------------------------------------
				  
		Sequence  Record Data					  Processing Data				  Player Data
				  
		1-------  Buffer1						  Buffer2						  Buffer3 BUF3_PLAY)
				  
		2-------  Buffer3						  Buffer1						  Buffer2 (BUF2_PLAY)		  
				  
		3-------  Buffer2						  Buffer3						  Buffer1 (BUF1_PLAY)
	 ---------------------------------------------------------------------------------------------------------------*/
				  /* Recording Audio Data */						 
				   switch (buffer_switch)
				   {
							case BUF1_PLAY:
#if MAIN_FFT
									//Data is updated to Buffer2
									if ((stLR==GPIO_PIN_SET)&&(stLROld==GPIO_PIN_RESET))
										Buffer2.bufMIC1[WaveRec_idxSens1++] = vRawSens1;
									if ((stLR==GPIO_PIN_RESET)&&(stLROld==GPIO_PIN_SET))
										Buffer2.bufMIC2[WaveRec_idxSens2++] = vRawSens2;
	
#else
                                if (WaveRec_idxSens1<=WaveRec_idxSens2)
									Buffer2.bufMIC1[WaveRec_idxSens1++] = vRawSens1;
							    else
									Buffer2.bufMIC2[WaveRec_idxSens2++] = vRawSens2;									
#endif
	
									break;
							case BUF2_PLAY:
#if MAIN_FFT
									//Data is updated to Buffer3				 
									if ((stLR==GPIO_PIN_SET)&&(stLROld==GPIO_PIN_RESET))
										Buffer3.bufMIC1[WaveRec_idxSens1++] = vRawSens1;
									if ((stLR==GPIO_PIN_RESET)&&(stLROld==GPIO_PIN_SET))
										Buffer3.bufMIC2[WaveRec_idxSens2++] = vRawSens2;
#else
                                if (WaveRec_idxSens1<=WaveRec_idxSens2)
									Buffer3.bufMIC1[WaveRec_idxSens1++] = vRawSens1;
							    else
									Buffer3.bufMIC2[WaveRec_idxSens2++] = vRawSens2;	
#endif
									break;
							case BUF3_PLAY:
#if MAIN_FFT
	
									//Data is update to Buffer1 	 
									if ((stLR==GPIO_PIN_SET)&&(stLROld==GPIO_PIN_RESET))
										Buffer1.bufMIC1[WaveRec_idxSens1++] = vRawSens1;
									if ((stLR==GPIO_PIN_RESET)&&(stLROld==GPIO_PIN_SET))
										Buffer1.bufMIC2[ WaveRec_idxSens2++] = vRawSens2;
#else
                                if (WaveRec_idxSens1<=WaveRec_idxSens2)
									Buffer1.bufMIC1[WaveRec_idxSens1++] = vRawSens1;
							    else
									Buffer1.bufMIC2[WaveRec_idxSens2++] = vRawSens2;									
#endif
									break;
							default:
									break; 
				   }
			
		 } 
#endif		
		/* Update Old value */	  
		stLROld=stLR;
		if(WaveRec_idxSens1 >= (2*AUDIO_OUT_BUFFER_SIZE-1))
		{
#ifndef CS43L22_PLAY	

			
#endif
           }
	  	}
				 
} 	 




/**
  * @brief  This function handles AUDIO_REC_SPI global interrupt request.
  * @param  None
  * @retval None
*/

void SPI2_IRQHandler(void)
{      
    uint16_t app;
    static uint8_t I2S2_stLR, I2S2_stLROld;

  /* Check if data are available in SPI Data register */
   if (
//	   (__HAL_SPI_GET_FLAG(&hi2s2, SPI_FLAG_OVR) == RESET)&&
//   	    (__HAL_SPI_GET_FLAG(&hi2s2, SPI_FLAG_RXNE) != RESET)&&
   	    (__HAL_I2S_GET_IT_SOURCE(&hi2s2, SPI_IT_RXNE)!=RESET)
   	  )
   {
    
     app = SPI_I2S_ReceiveData(SPI2);   
     //SPI_I2S_SendData(SPI2, 3333);

	 I2S2_stLR= HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_4);

	 if (I2S2_stLR==GPIO_PIN_SET)
	 {
        if (I2S2_stLROld==GPIO_PIN_SET)
        {
            I2S2_stNipple = app;           
        }
		else
		{

			 vRawSens3 = ((app>>I2S2_stPosShft)|(I2S2_stNipple<<(SDOLEN-I2S2_stPosShft)));

		}
	 }
	 else
	 {
        if (I2S2_stLROld==GPIO_PIN_RESET)
        {
            I2S2_stNipple = app;

