PhanLeSon03/Mic_Array/Projects/STM32746G/Applications/Audio/Mic_Array/Src/waverecorder.c
        }
		else
		{
            vRawSens4 =((app>>I2S2_stPosShft)|(I2S2_stNipple<<(SDOLEN-I2S2_stPosShft)));
		
		}
	 }

	 	if (iSDO34<4*AUDIO_OUT_BUFFER_SIZE)
	   {
           TestSDO34[iSDO34++]=app;
	   }
	   else
	   {
           iSDO34=0;
	   }
	 
#if 1
	 if ((WaveRec_idxSens3 < (2*AUDIO_OUT_BUFFER_SIZE+1))&&(WaveRec_idxSens4 < (2*AUDIO_OUT_BUFFER_SIZE+1)))
//             &&(I2S2_stLR!=I2S2_stLROld))
	 {
/*-------------------------------------------------------------------------------------------------------------
			  
	Sequence  Record Data                     Processing Data                 Player Data
			  
	1-------  Buffer1                         Buffer2                         Buffer3 (BUF3_PLAY)
			  
	2-------  Buffer3                         Buffer1                         Buffer2 (BUF2_PLAY)		  
			  
	3-------  Buffer2                         Buffer3                         Buffer1 (BUF1_PLAY)
 ---------------------------------------------------------------------------------------------------------------*/
		/* Recording Audio Data */			             
		 switch (buffer_switch)
		 {
			  case BUF1_PLAY:
				  //Data is updated to Buffer2
				  //PDM_Filter_64_LSB((uint8_t *)InternalBuffer, (uint16_t *)(buffer2+cntPos*PCM_OUT_SIZE), volume , (PDMFilter_InitStruct *)&Filter[0]);
#if MAIN_FFT
				  if ((I2S2_stLR==GPIO_PIN_SET)&&(I2S2_stLROld==GPIO_PIN_RESET))
				      Buffer2.bufMIC3[WaveRec_idxSens3++] = vRawSens3;
				  if ((I2S2_stLR==GPIO_PIN_RESET)&&(I2S2_stLROld==GPIO_PIN_SET))
				      Buffer2.bufMIC4[WaveRec_idxSens4++] = vRawSens4;
#else
                  if (WaveRec_idxSens3<=WaveRec_idxSens4) 
                      Buffer2.bufMIC3[WaveRec_idxSens3++] = vRawSens3;
				  else
                      Buffer2.bufMIC4[WaveRec_idxSens4++] = vRawSens4;			  
#endif 
				  break;
			  case BUF2_PLAY:
				  //Data is updated to Buffer3
				  //PDM_Filter_64_LSB((uint8_t *)InternalBuffer, (uint16_t *)(buffer3+cntPos*PCM_OUT_SIZE), volume , (PDMFilter_InitStruct *)&Filter[0]);
#if MAIN_FFT
				  if ((I2S2_stLR==GPIO_PIN_SET)&&(I2S2_stLROld==GPIO_PIN_RESET))
				      Buffer3.bufMIC3[WaveRec_idxSens3++] = vRawSens3;
				  if ((I2S2_stLR==GPIO_PIN_RESET)&&(I2S2_stLROld==GPIO_PIN_SET))
				      Buffer3.bufMIC4[WaveRec_idxSens4++] = vRawSens4;
#else
                  if (WaveRec_idxSens3<=WaveRec_idxSens4) 
                      Buffer3.bufMIC3[WaveRec_idxSens3++] = vRawSens3;
				  else
                      Buffer3.bufMIC4[WaveRec_idxSens4++] = vRawSens4;			   
#endif
				  break;
			  case BUF3_PLAY:
				  //Data is update to Buffer1
				  //PDM_Filter_64_LSB((uint8_t *)InternalBuffer, (uint16_t *)(buffer1+cntPos*PCM_OUT_SIZE), volume , (PDMFilter_InitStruct *)&Filter[0]);
#if MAIN_FFT
				  if ((I2S2_stLR==GPIO_PIN_SET)&&(I2S2_stLROld==GPIO_PIN_RESET))
     				  Buffer1.bufMIC3[WaveRec_idxSens3++] = vRawSens3;
  				  if ((I2S2_stLR==GPIO_PIN_RESET)&&(I2S2_stLROld==GPIO_PIN_SET))
     				  Buffer1.bufMIC4[ WaveRec_idxSens4++] = vRawSens4;
#else
                  if (WaveRec_idxSens3<=WaveRec_idxSens4) 
                      Buffer1.bufMIC3[WaveRec_idxSens3++] = vRawSens3;
				  else
                      Buffer1.bufMIC4[WaveRec_idxSens4++] = vRawSens4;


#endif
				  break;
			  default:
				  break; 
		 }
		
	 }          
#endif		  
	 I2S2_stLROld = I2S2_stLR;

   }

}


void SPI4_IRQHandler(void)
{
  static uint8_t Main_stLR, Main_stLROld;



  /* USER CODE BEGIN SPI5_IRQn 0 */

  /* USER CODE END SPI5_IRQn 0 */
  //HAL_SPI_IRQHandler(&hspi5);
  /* USER CODE BEGIN SPI5_IRQn 1 */

  /* USER CODE END SPI5_IRQn 1 */
    /* Check if data are available in SPI Data register */
  /* SPI in mode Receiver ----------------------------------------------------*/
  if(
//    (__HAL_SPI_GET_FLAG(&hspi4, SPI_FLAG_OVR) == RESET)&&
//    (__HAL_SPI_GET_FLAG(&hspi4, SPI_FLAG_RXNE) != RESET)&&
     (__HAL_SPI_GET_IT_SOURCE(&hspi4, SPI_IT_RXNE) != RESET))
  {

        uint16_t test;
        test =  SPI_I2S_ReceiveData(SPI4);

        /* Left-Right Mic data */
        Main_stLR= HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_4);

        /* STM32F746 read data from STA321MP, the data is shifted few bit     */
        /* Data from STA321MP is 32bit formart                                */
        /* SPI is just able to read 16 bit format                             */
        /* Therefore, it needs to correct                                     */
        
        /* ---------------------------+++++++++++++++++++++++++++++++---------*/
        /*                  ______DATAL_____              ______DATAR_____    */
        /*                  _____vRawSens5__              ______vRawSens6_    */       
	if (Main_stLR==GPIO_PIN_SET)
	{
            if (Main_stLROld==GPIO_PIN_SET)
            {
               SPI4_stNipple = (test);    
            }
            else
            {
               vRawSens5 =((test>>SPI4_stPosShft)|(SPI4_stNipple<<(SDOLEN-SPI4_stPosShft)));	
               if (WaveRec_idxSens5 < (2*AUDIO_OUT_BUFFER_SIZE+2))
               {
                    /*-------------------------------------------------------------------------------------------------------------                                             
                    Sequence  Record Data                     Processing Data                 Player Data
                                      
                    1-------  Buffer1                         Buffer2                         Buffer3 BUF3_PLAY)
                                      
                    2-------  Buffer3                         Buffer1                         Buffer2 (BUF2_PLAY)		  
                                      
                    3-------  Buffer2                         Buffer3                         Buffer1 (BUF1_PLAY)
                     ---------------------------------------------------------------------------------------------------------------*/                     
                     /* Recording Audio Data */			             
                     switch (buffer_switch)
                     {
                         case BUF1_PLAY:
                             Buffer2.bufMIC5[WaveRec_idxSens5++] = vRawSens5;
                             Buffer2.bufMIC5[WaveRec_idxSens5++] = vRawSens5;
                             break;
                         case BUF2_PLAY:
                             Buffer3.bufMIC5[WaveRec_idxSens5++] = vRawSens5;
                             Buffer3.bufMIC5[WaveRec_idxSens5++] = vRawSens5;
                             break;
                         case BUF3_PLAY:
                             Buffer1.bufMIC5[WaveRec_idxSens5++] = vRawSens5;
                             Buffer1.bufMIC5[WaveRec_idxSens5++] = vRawSens5;
                             break;                          
                         default:
                             break;
                     }
               }
	   }
        }
	else
	{
          if (Main_stLROld==GPIO_PIN_RESET)
          {
              SPI4_stNipple = (test);	  

