PhanLeSon03/Mic_Array/Projects/STM32746G/Applications/Audio/Mic_Array/Src/waverecorder.c
          }
          else
          {
               vRawSens6 =((test>>SPI4_stPosShft)|(SPI4_stNipple<<(SDOLEN-SPI4_stPosShft)));
               if (WaveRec_idxSens6 < (2*AUDIO_OUT_BUFFER_SIZE+2))
               {
                    /*-------------------------------------------------------------------------------------------------------------                                             
                    Sequence  Record Data                     Processing Data                 Player Data
                                      
                    1-------  Buffer1                         Buffer2                         Buffer3 BUF3_PLAY)
                                      
                    2-------  Buffer3                         Buffer1                         Buffer2 (BUF2_PLAY)		  
                                      
                    3-------  Buffer2                         Buffer3                         Buffer1 (BUF1_PLAY)
                     ---------------------------------------------------------------------------------------------------------------*/                 
                      /* Recording Audio Data */			             
                     switch (buffer_switch)
                     {
                         case BUF1_PLAY:
                             Buffer2.bufMIC6[WaveRec_idxSens6++] = vRawSens6;
                             Buffer2.bufMIC6[WaveRec_idxSens6++] = vRawSens6;
                             break;
                         case BUF2_PLAY:
                             Buffer3.bufMIC6[WaveRec_idxSens6++] = vRawSens6;
                             Buffer3.bufMIC6[WaveRec_idxSens6++] = vRawSens6;
                             break;
                         case BUF3_PLAY:
                             Buffer1.bufMIC6[WaveRec_idxSens6++] = vRawSens6;
                             Buffer1.bufMIC6[WaveRec_idxSens6++] = vRawSens6;
                             break;                          
                         default:
                             break;
                     }
               }
          }		
	}

	/* The code to store data in to buffer for testing purpose */
	if (iSDO56<4*AUDIO_OUT_BUFFER_SIZE)
	{
		TestSDO56[iSDO56++]=test;
	}
	else
	{
		iSDO56=0;
	}


	/* Update Old value */	  
	Main_stLROld=Main_stLR;	  
     
  }      
}




void SPI5_IRQHandler(void)
{
  //static uint16_t stNipple;
  //static uint8_t stLR, stOder;

  /* USER CODE BEGIN SPI5_IRQn 0 */

  /* USER CODE END SPI5_IRQn 0 */
  //HAL_SPI_IRQHandler(&hspi5);
  /* USER CODE BEGIN SPI5_IRQn 1 */

  /* USER CODE END SPI5_IRQn 1 */
    /* Check if data are available in SPI Data register */
  /* SPI in mode Receiver ----------------------------------------------------*/
  if(
     (__HAL_SPI_GET_FLAG(&hspi5, SPI_FLAG_OVR) == RESET)&&
     (__HAL_SPI_GET_FLAG(&hspi5, SPI_FLAG_RXNE) != RESET)&&
     (__HAL_SPI_GET_IT_SOURCE(&hspi5, SPI_IT_RXNE) != RESET))
  {


   uint16_t test;
   test =  SPI_I2S_ReceiveData(SPI5);
   SPI5->DR = 3333;

  pDataMic8[idxMic8++] =	HTONS(test);
  
  //volume = 64;
  
  if (idxMic8>=64)
  {
	if (buffer_switch != 1)
	{
		PDM_Filter_64_LSB((uint8_t *)pDataMic8,(uint16_t *)(bufPCMSens8 + cntPos*16), volume ,
						  (PDMFilter_InitStruct *)&Filter[0]);
	}
	else
	{
		PDM_Filter_64_LSB((uint8_t *)pDataMic8,(uint16_t *)(bufPCMSens8 + cntPos*16), volume , 
						  (PDMFilter_InitStruct *)&Filter[0]);   
	}
	idxMic8=0;
	cntPos++;
	if (cntPos>=256) cntPos=0;
  }
    
  }
  
}

/* SPI5 init function */


void SPI6_IRQHandler(void)
{
  /* SPI in mode Receiver ----------------------------------------------------*/
  if(
//     (__HAL_SPI_GET_FLAG(&hspi6, SPI_FLAG_OVR) == RESET)&&
     (__HAL_SPI_GET_FLAG(&hspi6, SPI_FLAG_TXE) != RESET)&&
     (__HAL_SPI_GET_IT_SOURCE(&hspi6, SPI_IT_TXE) != RESET))
  {


     uint16_t test;
     test =  SPI_I2S_ReceiveData(SPI6);
     SPI6->DR = 3333;

    pDataMic7[idxMic7++] =	HTONS(test);

    //volume = 64;

    if (idxMic7>=64)
    {
      if (buffer_switch != 1)
      {
              PDM_Filter_64_LSB((uint8_t *)pDataMic7,(uint16_t *)(bufPCMSens7 + cntPos7*16), volume ,
                                                (PDMFilter_InitStruct *)&Filter[1]);
      }
      else
      {
              PDM_Filter_64_LSB((uint8_t *)pDataMic7,(uint16_t *)(bufPCMSens7 + cntPos7*16), volume , 
                                                (PDMFilter_InitStruct *)&Filter[1]);   
      }
      idxMic7=0;
      cntPos7++;
      if (cntPos7>=256) cntPos7=0;
    }
    
  }
}



void MIC1TO6_Init(void)
{
  while(HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_4)==GPIO_PIN_SET);
  while(HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_4)==GPIO_PIN_RESET);
  I2S1_Init(); /* I2S1   --> SDO12 */
  while(HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_4)==GPIO_PIN_SET);
  while(HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_4)==GPIO_PIN_RESET);
  I2S2_Init(); /* I2S2   --> SDO34 */
  while(HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_4)==GPIO_PIN_SET);
  while(HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_4)==GPIO_PIN_RESET);
  SPI4_Init(); /* SPI4   --> SDO56 */

  SPI5_Init();
  SPI6_Init();

  //StartRecMic7_8();
}

void StartRecMic7_8 (void)
{
	  HAL_SPI_Receive_DMA(&hspi5,( uint8_t *)TestSDO7,4*AUDIO_OUT_BUFFER_SIZE);
#if (USB_STREAMING)
	  HAL_SPI_Receive_DMA(&hspi6,( uint8_t *)TestSDO8,4*(AUDIO_SAMPLING_FREQUENCY/1000));
#else
	  HAL_SPI_Receive_DMA(&hspi6,( uint8_t *)TestSDO8,4*AUDIO_OUT_BUFFER_SIZE);
#endif
	  swtSDO7 = 0;
	  swtSDO8 = 0;

}

/* I2S1 init function */
/* Read data of MIC12 */
static void I2S1_Init(void)
{
#if 1
  hi2s1.Instance = SPI1;
  hi2s1.Init.Mode = I2S_MODE_SLAVE_RX;
  hi2s1.Init.Standard = I2S_STANDARD_LSB;
  hi2s1.Init.DataFormat = I2S_DATAFORMAT_16B;
  hi2s1.Init.MCLKOutput = I2S_MCLKOUTPUT_DISABLE;
  hi2s1.Init.AudioFreq = I2S_AUDIOFREQ_16K;
  hi2s1.Init.CPOL = I2S_CPOL_LOW;
  hi2s1.Init.ClockSource = I2S_CLOCK_EXTERNAL;
  HAL_I2S_Init(&hi2s1);

     /* Enable TXE and ERR interrupt */
 __HAL_I2S_ENABLE_IT(&hi2s1, (I2S_IT_RXNE));
 
 __HAL_I2S_ENABLE(&hi2s1);
#else
	hspi1.Instance = SPI1;
	hspi1.Init.Mode = SPI_MODE_SLAVE;
	hspi1.Init.Direction = SPI_DIRECTION_2LINES;//SPI_DIRECTION_2LINES_RXONLY
	hspi1.Init.DataSize = SPI_DATASIZE_16BIT;
	hspi1.Init.CLKPolarity = SPI_POLARITY_HIGH;
	hspi1.Init.CLKPhase = SPI_PHASE_1EDGE;
	hspi1.Init.NSS = SPI_NSS_SOFT;//SPI_NSS_HARD_INPUT
	hspi1.Init.FirstBit = SPI_FIRSTBIT_MSB;
	hspi1.Init.TIMode = SPI_TIMODE_DISABLE;
	hspi1.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLED;
	hspi1.Init.CRCPolynomial = 7;
	hspi1.Init.CRCLength = SPI_CRC_LENGTH_DATASIZE;
	hspi1.Init.NSSPMode = SPI_NSS_PULSE_DISABLE;
	//hspi4.RxISR = SPI5_CallBack;
	HAL_SPI_Init(&hspi1);

