PhanLeSon03/Mic_Array/Projects/STM32746G/Applications/Audio/Mic_Array/Src/waverecorder.c
  /* USER CODE END SPI6_MspInit 0 */
    /* Peripheral clock enable */
    __SPI6_CLK_ENABLE();
    __HAL_RCC_GPIOG_CLK_ENABLE();
  
    /**SPI6 GPIO Configuration    
    PG13     ------> SPI6_SCK
    PG14     ------> SPI6_MOSI 
    */
    GPIO_InitStruct.Pin = GPIO_PIN_13|GPIO_PIN_14;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF5_SPI6;
    HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

#if 0
	  /* Peripheral interrupt init*/
    HAL_NVIC_SetPriority(SPI6_IRQn, INTERRUPT_PRI_SDO8, 1);
    HAL_NVIC_EnableIRQ(SPI6_IRQn);
#else
	/* Peripheral DMA init*/
	__HAL_RCC_DMA2_CLK_ENABLE();
	hdma_spi6_rx.Instance = DMA2_Stream6;
	hdma_spi6_rx.Init.Channel = DMA_CHANNEL_1;
	hdma_spi6_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
	hdma_spi6_rx.Init.PeriphInc = DMA_PINC_DISABLE;
	hdma_spi6_rx.Init.MemInc = DMA_MINC_ENABLE;
	hdma_spi6_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
	hdma_spi6_rx.Init.MemDataAlignment = DMA_PDATAALIGN_HALFWORD;
	hdma_spi6_rx.Init.Mode = DMA_NORMAL;
	hdma_spi6_rx.Init.Priority = DMA_PRIORITY_HIGH;
	hdma_spi6_rx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
	hdma_spi6_rx.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
	hdma_spi6_rx.Init.MemBurst = DMA_MBURST_SINGLE;
	hdma_spi6_rx.Init.PeriphBurst = DMA_PBURST_SINGLE;
	HAL_DMA_Init(&hdma_spi6_rx);

	__HAL_LINKDMA(hspi,hdmarx,hdma_spi6_rx);

	HAL_NVIC_SetPriority(DMA2_Stream6_IRQn, INTERRUPT_PRI_SDO8, 1);
	HAL_NVIC_EnableIRQ(DMA2_Stream6_IRQn);

#endif
  }

}




static void SPI_I2S_SendData(SPI_TypeDef* SPIx, uint16_t Data)
{
  /* Check the parameters */
  assert_param(IS_SPI_ALL_PERIPH_EXT(SPIx));
  
  /* Write in the DR register the data to be sent */
  SPIx->DR = Data;
}


static uint16_t SPI_I2S_ReceiveData(SPI_TypeDef* SPIx)
{
  /* Check the parameters */
  assert_param(IS_SPI_ALL_PERIPH_EXT(SPIx));
  
  /* Return the data in the DR register */
  return SPIx->DR;
}


void RecordUpdBuf(void)
{

     if (WaveRecord_flgInt==2)
     {
        WaveRecord_flgInt=0;
			if ((WaveRec_idxSens1 < (AUDIO_OUT_BUFFER_SIZE))&&(WaveRec_idxSens2 < (AUDIO_OUT_BUFFER_SIZE)))
		//			  &&(stLR!=stLROld))
			{
		/*-------------------------------------------------------------------------------------------------------------
					  
			Sequence  Record Data					  Processing Data				  Player Data
					  
			1-------  Buffer1						  Buffer2						  Buffer3 BUF3_PLAY)
					  
			2-------  Buffer3						  Buffer1						  Buffer2 (BUF2_PLAY)		  
					  
			3-------  Buffer2						  Buffer3						  Buffer1 (BUF1_PLAY)
		 ---------------------------------------------------------------------------------------------------------------*/
					  /* Recording Audio Data */						 
					   switch (buffer_switch)
					   {
								case BUF1_PLAY:

										Buffer2.bufMIC1[WaveRec_idxSens1++] = vRawSens1;
										Buffer2.bufMIC2[WaveRec_idxSens2++] = vRawSens2;
										Buffer2.bufMIC3[WaveRec_idxSens3++] = vRawSens3;
										Buffer2.bufMIC4[WaveRec_idxSens4++] = vRawSens4;
										Buffer2.bufMIC5[WaveRec_idxSens5++] = vRawSens5;
										Buffer2.bufMIC6[WaveRec_idxSens6++] = vRawSens6;
	
										break;
								case BUF2_PLAY:

										Buffer3.bufMIC1[WaveRec_idxSens1++] = vRawSens1;
										Buffer3.bufMIC2[WaveRec_idxSens2++] = vRawSens2;
										Buffer3.bufMIC3[WaveRec_idxSens3++] = vRawSens3;
										Buffer3.bufMIC4[WaveRec_idxSens4++] = vRawSens4;
										Buffer3.bufMIC5[WaveRec_idxSens5++] = vRawSens5;
										Buffer3.bufMIC6[WaveRec_idxSens6++] = vRawSens6;
		

										break;
								case BUF3_PLAY:

										Buffer1.bufMIC1[WaveRec_idxSens1++] = vRawSens1;
										Buffer1.bufMIC2[ WaveRec_idxSens2++] = vRawSens2;
										Buffer1.bufMIC3[WaveRec_idxSens3++] = vRawSens3;
										Buffer1.bufMIC4[ WaveRec_idxSens4++] = vRawSens4;
										Buffer1.bufMIC5[WaveRec_idxSens5++] = vRawSens5;
										Buffer1.bufMIC6[ WaveRec_idxSens6++] = vRawSens6;
										break;
								default:
										break; 
					   }
				
				}
                     
     	}
}


void DMA2_Stream5_IRQHandler(void)
{
  /* USER CODE BEGIN DMA2_Stream5_IRQn 0 */

  /* USER CODE END DMA2_Stream5_IRQn 0 */
  HAL_DMA_IRQHandler(&hdma_spi5_rx);
  /* USER CODE BEGIN DMA2_Stream5_IRQn 1 */

  /* USER CODE END DMA2_Stream5_IRQn 1 */
}

/**
* @brief This function handles DMA2 stream6 global interrupt.
*/
void DMA2_Stream6_IRQHandler(void)
{
  /* USER CODE BEGIN DMA2_Stream6_IRQn 0 */

  /* USER CODE END DMA2_Stream6_IRQn 0 */
  HAL_DMA_IRQHandler(&hdma_spi6_rx);
  /* USER CODE BEGIN DMA2_Stream6_IRQn 1 */

  /* USER CODE END DMA2_Stream6_IRQn 1 */
}

void HAL_SPI_RxCpltCallback(SPI_HandleTypeDef *hspi)
{
    if(hspi->Instance==SPI1)
    {
        /* Copy Data to Record Buffer */
		//RecordUpdBuf();
		//XferCplt = 1;
        //Audio_Play_Out();
    }
    else if (hspi->Instance==SPI2)
    {

    }
    else if (hspi->Instance==SPI4)
    {

    }
    else if (hspi->Instance==SPI5)
    {
        swtSDO7^=0x01;
        WaveRecord_flgSDO7Finish = 1;
        if (swtSDO7==0x01)
        {
            HAL_SPI_Receive_DMA(&hspi5,( uint8_t *)TestSDO7_1,4*AUDIO_OUT_BUFFER_SIZE);
        }
        else
        {
            HAL_SPI_Receive_DMA(&hspi5,( uint8_t *)TestSDO7,4*AUDIO_OUT_BUFFER_SIZE);
        }
    }
    else
    {
      
    }
    
    if (hspi->Instance==SPI6) //MIC8
    {
#if USB_STREAMING							

    if (swtSDO8==0x01)
   {
       HAL_SPI_Receive_DMA(&hspi6,( uint8_t *)&TestSDO8_1[64*idxFrmPDMMic8],4*(AUDIO_SAMPLING_FREQUENCY/1000));
   }
   else
   {
	   HAL_SPI_Receive_DMA(&hspi6,( uint8_t *)&TestSDO8[64*idxFrmPDMMic8],4*(AUDIO_SAMPLING_FREQUENCY/1000));
   }      
   AudioUSBSend(idxFrmPDMMic8++);

   if(idxFrmPDMMic8==(4*AUDIO_OUT_BUFFER_SIZE/64))
   {
       swtSDO8^=0x01;
	   WaveRecord_flgSDO8Finish = 1;
       idxFrmPDMMic8 = 0;
		RESET_IDX
		XferCplt = 0; // clear DMA interrupt flag
		switch (buffer_switch)
		{
	        case BUF1_PLAY: 		
	          buffer_switch = BUF3_PLAY;
	          break;
	        case BUF2_PLAY: 
	          buffer_switch = BUF1_PLAY;		
	          break;
	        case BUF3_PLAY: 	
	          buffer_switch = BUF2_PLAY;
	          break;
	        default:
	          break;
		}

		/* Last player Frame is finished */
		AudioPlayerUpd(); 		
		
