PhanLeSon03/Mic_Array/Projects/STM32746G/Applications/Audio/Mic_Array/Src/waverecorder.c
		if (cntStrt<100) cntStrt++;		   
   }


#else
    swtSDO8^=0x01;
    WaveRecord_flgSDO8Finish = 1;
    if (swtSDO8==0x01)
    {
        HAL_SPI_Receive_DMA(&hspi6,( uint8_t *)TestSDO8_1,4*AUDIO_OUT_BUFFER_SIZE);
    }
    else
    {
        HAL_SPI_Receive_DMA(&hspi6,( uint8_t *)TestSDO8,4*AUDIO_OUT_BUFFER_SIZE);

    }
#endif

  }
}

void PDM2PCMSDO78(void)
{
/*-------------------------------------------------------------------------------------------------------------
			  
	Sequence  Record Data					  Processing Data				  Player Data
			  
	1-------  Buffer1						  Buffer2				  Buffer3 BUF3_PLAY)
			  
	2-------  Buffer3						  Buffer1				  Buffer2 (BUF2_PLAY)		  
			  
	3-------  Buffer2						  Buffer3				  Buffer1 (BUF1_PLAY)
 ---------------------------------------------------------------------------------------------------------------*/

    /* Data in Mic7 finished recording */
    if (WaveRecord_flgSDO7Finish==1)
    {
        WaveRecord_flgSDO7Finish=0;

		for (uint16_t i=0; i< 4*AUDIO_OUT_BUFFER_SIZE;i++)
		{
	            if(swtSDO7==0x01)
	            {
	                pDataMic7[i%64] = HTONS(TestSDO7[i]);
	            }
	            else
	            {
	               pDataMic7[i%64] = HTONS(TestSDO7_1[i]);

	            }

	            /* PDM conversion for frame of 64 inputs, 16 outputs */
	            if (i%64==63)
	            {
	              /* Recording Audio Data */						 
	              switch (buffer_switch)
	              {
	                case BUF1_PLAY:								
	                      PDM_Filter_64_LSB((uint8_t *)pDataMic7,(uint16_t *)(Buffer2.bufMIC7 + (i/64)*16), 100 ,
	                      (PDMFilter_InitStruct *)&Filter[0]);
	                      break;
	                case BUF2_PLAY:
	                        PDM_Filter_64_LSB((uint8_t *)pDataMic7,(uint16_t *)(Buffer3.bufMIC7 + (i/64)*16), 100 ,
	                        (PDMFilter_InitStruct *)&Filter[0]);	
	                        break;
	                case BUF3_PLAY:
	                        PDM_Filter_64_LSB((uint8_t *)pDataMic7,(uint16_t *)(Buffer1.bufMIC7 + (i/64)*16), 100 ,
	                        (PDMFilter_InitStruct *)&Filter[0]);									
	                         break;
	                default:
	                         break; 
	              }
		        }
	      }//if (WaveRecord_flgSDO7Finish==1)


            /* Recording Audio Data */						 
		    switch (buffer_switch)
		    {
		        case BUF1_PLAY:								
					        /* Update for left-right channel */
			        for (int16_t i=AUDIO_OUT_BUFFER_SIZE-1; i>=0;i--)
			        {
	                    Buffer2.bufMIC7[2*i+1]=  Buffer2.bufMIC7[i];
			            Buffer2.bufMIC7[2*i] = Buffer2.bufMIC7[i];
			        }
			            break;
			     case BUF2_PLAY:
			        /* Update for left-right channel */
			        for (int16_t i=AUDIO_OUT_BUFFER_SIZE-1; i>=0;i--)
			        {				 	
		                Buffer3.bufMIC7[2*i+1]= Buffer3.bufMIC7[i];
		                Buffer3.bufMIC7[2*i]= Buffer3.bufMIC7[i];;	
			        }
	                break;
	            case BUF3_PLAY:
			        /* Update for left-right channel */
			        for (int16_t i=AUDIO_OUT_BUFFER_SIZE-1; i>=0;i--)
			        {					
	                    Buffer1.bufMIC7[2*i+1]= Buffer1.bufMIC7[i];
	                    Buffer1.bufMIC7[2*i]= Buffer1.bufMIC7[i];;	
			        }
	                break;
	            default:
	                break; 
	        }
	    

     }
    

	/* Data in Mic8 finished recording */
	if (WaveRecord_flgSDO8Finish==1)
	{
		WaveRecord_flgSDO8Finish=0;
		
		for (uint16_t i=0; i< 4*AUDIO_OUT_BUFFER_SIZE;i++)
		{
                  if(swtSDO8==0x01)
                  {
                     pDataMic8[i%64] = HTONS(TestSDO8[i]);
                  }
                  else
                  {
                     pDataMic8[i%64] = HTONS(TestSDO8_1[i]);
                  }
		
                  /* PDM conversion for frame of 64 inputs, 16 outputs */
                  if (i%64==63)
                  {
                      /* Recording Audio Data */						 
                      switch (buffer_switch)
                      {
                              case BUF1_PLAY: 							
                                      PDM_Filter_64_LSB((uint8_t *)pDataMic8,(uint16_t *)(Buffer2.bufMIC8 + (i/64)*16), 80 ,
                                      (PDMFilter_InitStruct *)&Filter[1]);
                                      break;
                              case BUF2_PLAY:
                                      PDM_Filter_64_LSB((uint8_t *)pDataMic8,(uint16_t *)(Buffer3.bufMIC8 + (i/64)*16), 80 ,
                                      (PDMFilter_InitStruct *)&Filter[1]);	
                                      break;
                              case BUF3_PLAY:
                                      PDM_Filter_64_LSB((uint8_t *)pDataMic8,(uint16_t *)(Buffer1.bufMIC8 + (i/64)*16), 80 ,
                                      (PDMFilter_InitStruct *)&Filter[1]);									
                                       break;
                              default:
                                       break; 
                      }		
                   }					 
		}
                
          /* Recording Audio Data */						 
          switch (buffer_switch)
          {
              case BUF1_PLAY: 	
                      /* Update for left-right channel */
                      for (int16_t i=AUDIO_OUT_BUFFER_SIZE-1; i>=0;i--)
                      {
                          Buffer2.bufMIC8[2*i+1]=  Buffer2.bufMIC8[i];
                          Buffer2.bufMIC8[2*i] = Buffer2.bufMIC8[i];
                      }
                      break;
              case BUF2_PLAY:
                      /* Update for left-right channel */
                      for (int16_t i=AUDIO_OUT_BUFFER_SIZE-1; i>=0;i--)
                      {
                          Buffer3.bufMIC8[2*i+1]= Buffer3.bufMIC8[i];
                          Buffer3.bufMIC8[2*i]= Buffer3.bufMIC8[i];;	
                      }
                      break;
              case BUF3_PLAY:
                    /* Update for left-right channel */
                    for (int16_t i=AUDIO_OUT_BUFFER_SIZE-1; i>=0;i--)
                    {					
                        Buffer1.bufMIC8[2*i+1]= Buffer1.bufMIC8[i];
                        Buffer1.bufMIC8[2*i]= Buffer1.bufMIC8[i];
                    }
                    break;
              default:
                    break; 
          }                
   }//if (WaveRecord_flgSDO8Finish==1)
}



